In [9]:
import pandas as pd
def f():
    for i in range(3):
        globals() [f'a{i}']
a0 = 1
a1="hello"
a2=pd.DataFrame({'a':['x','y','z'],
                'b':[1,2,32]})
a2

   a   b
0  x   1
1  y   2
2  z  32

In [10]:
def fun():
    globals() ["m"]

In [11]:
m = 1
print(m)

1

In [12]:
list = [a2, pd.DataFrame({"a": ['w','t','c'], "b":[2, 5, 9]})]

In [13]:
list[0]

   a   b
0  x   1
1  y   2
2  z  32

In [14]:
list[1]

   a  b
0  w  2
1  t  5
2  c  9

In [15]:
df = list[0].append(list[1])

In [16]:
type(list[0])

pandas.core.frame.DataFrame

In [17]:
df

   a   b
0  x   1
1  y   2
2  z  32
0  w   2
1  t   5
2  c   9

In [18]:
df.reset_index(inplace=True)

In [19]:
df

   index  a   b
0      0  x   1
1      1  y   2
2      2  z  32
3      0  w   2
4      1  t   5
5      2  c   9

In [20]:
df.sample(1)

   index  a  b
5      2  c  9

In [21]:
df

   index  a   b
0      0  x   1
1      1  y   2
2      2  z  32
3      0  w   2
4      1  t   5
5      2  c   9

In [22]:
df.sample(3, replace=False)

   index  a  b
0      0  x  1
3      0  w  2
4      1  t  5

In [23]:
df

   index  a   b
0      0  x   1
1      1  y   2
2      2  z  32
3      0  w   2
4      1  t   5
5      2  c   9

In [24]:
df1 = df.sample(1)

In [25]:
df1

   index  a  b
5      2  c  9

In [26]:
df1 = df.sample(frac=1)

In [27]:
df1

   index  a   b
1      1  y   2
0      0  x   1
4      1  t   5
2      2  z  32
5      2  c   9
3      0  w   2

In [28]:
df2 = df.sample(frac=0.5)

In [29]:
df2

   index  a   b
2      2  z  32
1      1  y   2
5      2  c   9